Autodesk.Revit.ApplicationServices.ControlledApplication.WorksharedOperationProgressChanged
# Subscribe to the WorksharedOperationProgressChanged to be notified when progress has changed during Collaboration for Revit's workshared operations: open model and synchronize with central.
Remarks:
This event is only supported for Collaboration for Revit and will not be raised for those operations occurring in local-worksharing and Revit Server workflow.
Users may not change the document in the handler for this event.
If you do not need detailed progress information for synchronizing with central, see Autodesk.Revit.ApplicationServices.Application.DocumentSynchronizingWithCentral or Autodesk::Revit::DB::Events::DocumentSynchronizedWithCentral.
It is NOT recommended to do any time-consuming work when handling DocumentSynchronizingWithCentralProgessChanged event. This can increase workshared operation time."
Exception Autodesk.Revit.Exceptions.ModificationForbiddenException will be thrown if any document-modifying method is called during this event's handler.
Since:
2017 Subscription Update

Autodesk.Revit.ApplicationServices.ControlledApplication.LinkedResourceOpened
Subscribe to the LinkedResourceOpened event to be notified immediately after Revit has finished opening a linked resource.
Remarks:
This event is raised immediately after Revit has finished opening a linked resource.
Only supports linked resources for following types : Revit; IFC;
It is raised even when a linked resource opening failed.
The LinkedResourceOpened events would not raised if there are no update on linked IFC resources.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
Another Autodesk.Revit.ApplicationServices.Application.LinkedResourceOpening event will be raised when Revit is just about to
open a linked resource.
Since:
2018

Autodesk.Revit.ApplicationServices.ControlledApplication.LinkedResourceOpening
Subscribe to the LinkedResourceOpening event to be notified when Revit is just about to open a linked resource.
Remarks:
This event is raised when Revit is just about to open a linked resource.
Only supports linked resources for following types : Revit; IFC;
The LinkedResourceOpened events would not raised if there are no update on linked IFC resources.
Event is not cancellable.
The linked resource cannot be modified, for it is not opened yet at the time of the event.
Another Autodesk.Revit.ApplicationServices.Application.LinkedResourceOpened event will be raised immediately after
linked resource is opened.
Since:
2018

Autodesk.Revit.ApplicationServices.ControlledApplication.Assets(System.ValueType!Autodesk.Revit.Utility.AssetType!System.Runtime.CompilerServices.IsBoxed)
Returns a set of all the Assets within Revit of special type.
Remarks: Each Asset stores the information for rendering etc.